ERP.belugaerp/src/InformationRegisters/бг_НастройкиПоОперациямЕГАИС/бг_НастройкиПоОперациямЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_НастройкиПоОперациямЕГАИС</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоВПорцииОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалРегистрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыДокументовЕГАИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/СтатусыОбработкиСообщенийЕГАИС/СтатусыОбработкиСообщенийЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыОбработкиСообщенийЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ДокументПроведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПереданоВУТМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПринятИзЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/ЕГАИСПрисоединенныеФайлы/ЕГАИСПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЕГАИСПрисоединенныеФайлы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_АдресДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаТикетаЕГАИС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СправкаЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторЗапроса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФорматОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/InformationRegisters/бг_НастройкиПоОперациямЕГАИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ОперацииСОнлайнВыгрузкой() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Операция КАК Операция
		|ИЗ
		|	РегистрСведений.бг_НастройкиПоОперациямЕГАИС КАК Т
		|ГДЕ
		|	Т.Приоритет = 0";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Операция");
	
КонецФункции

Функция НедоступныеОперацииПоИнтервалуРегистрации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОперацииПоОрганизациям = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОписаниеПакета.ВладелецФайла КАК ОрганизацияЕГАИС,
	|	Настройки.ИнтервалРегистрации КАК Интервал,
	|	Настройки.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.бг_НастройкиПоОперациямЕГАИС КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕГАИСПрисоединенныеФайлы КАК ОписаниеПакета
	|		ПО Настройки.Операция = ОписаниеПакета.Операция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПередачиДанныхЕГАИС КАК Очередь
	|		ПО (Очередь.Сообщение = ОписаниеПакета.Ссылка)
	|ГДЕ
	|	Настройки.ИнтервалРегистрации > 0
	|	И (ОписаниеПакета.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиСообщенийЕГАИС.КПередаче)
	|			И НЕ Очередь.Сообщение ЕСТЬ NULL
	|		ИЛИ ОписаниеПакета.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиСообщенийЕГАИС.ПереданоВУТМ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОписаниеПакета.ВладелецФайла,
	|	Настройки.Операция,
	|	Настройки.ИнтервалРегистрации
	|
	|ИМЕЮЩИЕ
	|	РАЗНОСТЬДАТ(
	|		МАКСИМУМ(ВЫБОР
	|			КОГДА Очередь.Сообщение ЕСТЬ NULL
	|				ТОГДА ОписаниеПакета.ДатаСоздания
	|			ИНАЧЕ &ТекущаяДата
	|		КОНЕЦ), &ТекущаяДата, МИНУТА) < Настройки.ИнтервалРегистрации
	|
	|ИТОГИ ПО
	|	ОписаниеПакета.ВладелецФайла";

	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	ВыборкаПоОрганизациям = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Операции = Новый ТаблицаЗначений;
	Операции.Колонки.Добавить("Операция");
	Операции.Колонки.Добавить("Интервал");
	
	Пока ВыборкаПоОрганизациям.Следующий() Цикл
		
		Операции.Очистить();
		ВыборкаДетальная = ВыборкаПоОрганизациям.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Операции.Добавить(), ВыборкаДетальная);
		КонецЦикла;
		
		ОперацииПоОрганизациям.Вставить(ВыборкаПоОрганизациям.ОрганизацияЕГАИС, Операции);
		
	КонецЦикла;
	
	Возврат ОперацииПоОрганизациям;
	
КонецФункции

// Недоступные операции для отправки в УТМ, если с момента отправки не прошло достаточно времени.
// Параметры:
//	ОрганизацииЕГАИС - Массив - организации ЕГАИС.
// Возвращаемое значение:
//	Соответствие - операции по которым не прошло достаточно времени по организациям.
//
Функция НедоступныеОперацииПоИнтервалуОтправки(ОрганизацииЕГАИС) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОперацииПоОрганизациям = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОписаниеПакета.ВладелецФайла КАК ОрганизацияЕГАИС,
	|	Настройки.ИнтервалОтправки КАК Интервал,
	|	Настройки.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.бг_НастройкиПоОперациямЕГАИС КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕГАИСПрисоединенныеФайлы КАК ОписаниеПакета
	|		ПО Настройки.Операция = ОписаниеПакета.Операция
	|ГДЕ
	|	ОписаниеПакета.ВладелецФайла В (&ОрганизацииЕГАИС)
	|	И Настройки.ИнтервалОтправки > 0
	|	И ОписаниеПакета.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиСообщенийЕГАИС.ПереданоВУТМ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОписаниеПакета.ВладелецФайла,
	|	Настройки.Операция,
	|	Настройки.ИнтервалОтправки
	|
	|ИМЕЮЩИЕ
	|	РАЗНОСТЬДАТ(
	|		МАКСИМУМ(ОписаниеПакета.ДатаСоздания), &ТекущаяДата, МИНУТА) < Настройки.ИнтервалОтправки
	|
	|ИТОГИ ПО
	|	ОписаниеПакета.ВладелецФайла";

	Запрос.УстановитьПараметр("ОрганизацииЕГАИС", ОрганизацииЕГАИС);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	ВыборкаПоОрганизациям = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Операции = Новый ТаблицаЗначений;
	Операции.Колонки.Добавить("Операция");
	Операции.Колонки.Добавить("Интервал");
	
	Пока ВыборкаПоОрганизациям.Следующий() Цикл
		
		Операции.Очистить();
		ВыборкаДетальная = ВыборкаПоОрганизациям.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Операции.Добавить(), ВыборкаДетальная);
		КонецЦикла;
		
		ОперацииПоОрганизациям.Вставить(ВыборкаПоОрганизациям.ОрганизацияЕГАИС, Операции);
		
	КонецЦикла;
	
	Возврат ОперацииПоОрганизациям;
	
КонецФункции

#КонецОбласти

#КонецЕсли
